{
  "news": [],
  "strategies": [
    {
      "id": "2026-01-29-the-fomo-factor-in-malaysia-property-marketing",
      "title": "Beyond \"Limited Units\": A Framework for Property Marketing",
      "date": "2026-01-29T06:26:00.000Z",
      "tag": "Strategy • Marketing",
      "summary": "Is the classic 'Limited Units!' pitch still enough? Map booklets as experience vouchers, built-in area growth stories, and EdgeProp/StarProperty collaboration.",
      "body": "Is the classic 'Limited Units!' pitch still enough?\n\n\n\nHere's a conceptual framework I'm developing: map booklets as experience vouchers, built-in area growth stories, and collaborating with platforms like EdgeProp & StarProperty for added credibility.\n\n\n\nCurious to see how it could transform property marketing? Insights in the slides!\n\n\n\n{{PDF}}\n",
      "image": null,
      "videoId": null,
      "pdf": "/assets/uploads/the-fomo-factor.pdf",
      "pdfPreview": "/assets/uploads/pdf-preview-limited-units.jpg"
    },
    {
      "id": "2026-01-29-unlocking-location-value-in-property-marketing",
      "title": "Unlocking Location Value in Property Marketing",
      "date": "2026-01-29T05:49:00.000Z",
      "tag": "Strategy • Marketing",
      "summary": "How to leverage neighbourhood strengths when internal amenities aren't your strongest selling point.",
      "body": "Property marketers don't always have internal amenities that stand out as their strongest selling point. But what if we could \"borrow\" the strengths from the neighbourhood instead?\n\n\n\n\\### The Sunway Lagoon example\n\nConsider properties near Sunway Lagoon. Instead of just highlighting proximity, why not run a digital campaign offering a free theme park day pass for lead generation? For actual buyers, give a truly unique reward: a 5-year annual pass to Sunway Lagoon, which means up to 1,825 days of free family fun, making lifestyle and experience part of the value proposition.\n\n\n\n\\### Why limit the campaign to 3 months?\n\nTo create urgency, this campaign would run for only 3 months. Why? Because effective marketing is about storytelling and stories need momentum and fresh twists to stay compelling. Extending a campaign indefinitely leads to audience fatigue, switching strategies every quarter keeps the message vibrant and prospects engaged.\n\n\n\n\\### The template for other locations\n\nFor those marketing properties outside Sunway, this strategy is just a template. Audit your local area for interesting lifestyle spots—whether it's a theme park, retail hub, cultural centre, or nature retreat—and craft an irresistible campaign that leverages those neighbourhood strengths.\n\n\n\n\\### Bottom line\n\nDon't just sell units, sell gateways to experiences people desire.\n",
      "image": null,
      "videoId": null,
      "pdf": null,
      "pdfPreview": null
    },
    {
      "id": "2026-01-29-dont-just-consume-content—redevelop-it-with-ai",
      "title": "Don't just consume content—redevelop it with AI",
      "date": "2026-01-29T05:47:00.000Z",
      "tag": "Strategy • Workflow",
      "summary": "A simple workflow: take a useful video, feed it into AI with your intention, and extract structured insights for your team.",
      "body": "In our field, we come across useful videos, ideas, and insights almost every day.\n\nMost people watch, nod, and move on. That's where the opportunity dies. When I find content relevant to sales, marketing, consumer psychology, or team development, I treat it as raw material—something I can reshape into practical value. And with AI, this process has never been easier or faster.\n\n\\### The input\n\nI watched a solid video and instead of just saving it, I fed it into AI along with my intentions.\n\n{{VIDEO}}\n\n\\### The workflow (real example)\n\nI'm sharing my prompt screenshot (not because it's perfect) but to show how simple the workflow can be.\n\n{{IMAGE}}\n\n\\### The result\n\nWithin minutes, AI turned that video into structured insights I can use for my team.\n\n\\### My takeaway\n\nThis isn't about replacing thinking. It's about training ourselves to think better and letting technology amplify that thinking.\n\nDon't just consume content. Redevelop it. Adapt it. Extract value from it. The real skill today is turning information into output quickly.\n",
      "image": "/assets/uploads/prompting.jpg",
      "videoId": "K7TPA6GdBqI",
      "pdf": null,
      "pdfPreview": null
    }
  ]
}